---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurveLoopsProfile
source: html/f6b6a0bf-427c-30d8-990a-f9b9b8db6743.htm
---
# CurveLoopsProfile Methods

Causes the object to release immediately any resources it may be utilizing.